app/Controllers/Home.php

SELECT *
FROM `empleados`
WHERE `empleados`.`id` = '2'
---
    public function listassignments($id){
        $db = db_connect();
        $query1 = "select * from detalle_asignaciones where id_estado_devolucion = ? and id_empleado = ?";
        $query2 = "select * from detalle_asignaciones where id_estado_devolucion < ? and id_empleado = ?";
        $result1 = $db->query($query1,[7,$id])->getResult();
        $result2 = $db->query($query2,[7,$id])->getResult();
        $empleado = new EmpleadoModel();

        $data['asignaciones_activas'] = $result1;
        $data['asignaciones_historial'] = $result2;
        $data['empleado'] = $empleado->find($id);

SELECT *
FROM `empleados`
WHERE `empleados`.`id` = '2'
---
        $result3 = $db->query($query3)->getResult();


        $data['empleado'] = $empleado->find($id);

SELECT *
FROM `item_bolsa`
---
    public function bag(){
        $db = db_connect();

        //bolsa existe
        $query1 = "select * from bolsa limit 1";
        $result1 = $db->query($query1)->getResult();

        //correos
        $query2 = "select * from correos";
        $result2 = $db->query($query2)->getResult();
        $correos = "";
        foreach($result2 as $res){
            $correos .= $res->correo . ", ";
        }



        $itembolsa = new ItemBolsaModel();
        $items = $itembolsa->findAll();